/*
Задача 3. Дефинирайте потребителски тип към указател.Създайте променлива,
насочете указателя към нея, използвайки новия потребителски тип.
*/

#include<stdio.h>

typedef char *ptr;

int main()
{
    ptr a;
    char name[20] = "Test";
    a = name;

    printf("%s", a); // Test;
}