#include<stdio.h>
int main(){
    unsigned char num_char = "(255+10)";
    printf("%d", (char)(255+10)); // 9
    return 0;
}
/*
1. от от десетична в бинарна(0и1) -> 100001001
2. режене на бинарния код до 8 бита(0000 0001 - примерно) ->00001001
3. от бинарна в десетична -> 9
4. понеже е чар от аски търси символа, койо отговаря на 9 -> 
Когато в юат сложим число то се представя в бинарен код самото число, което е много дълго,
Но понеже чар съдържа само 8 бита то се реже до последните 8 (0 и 1)
Десетичната стойност от поседните 8 бита е спрамо АСКИ и му търси символа. 
*/
