/*
Разглеждане на rand() и RAND_MAX от библиотеката <stdlib.h>

Напишете програма, която създава и инициализира динамичен едномерен масив
от 100 двуцифрени цели числа. За целта използвайте функцията rand(),
генерираща случайно число в диапазона от 0 до RAND_MAX, включително.

rand_max() - генерират се цели числа то 0 - rand_max включително
*/

#include<stdio.h>
#include<stdlib.h>

int main()
{
    printf("%d\n", RAND_MAX);

    int *arr = malloc(100 * sizeof(int)); // създаваме указател към тип int и този указател го инициализираме с malloc() 

    for (int i = 0; i < 100; i++)
    {
        *(arr+i) = rand()%100; // за да бъдат двуцифрени %100
    }

    for (int i = 0; i < 100; i++)
    {
        printf("%d \t", *(arr + i));
    }
}
