#include<stdio.h>
int main()
{
    int a[3] = {1,2,3}; // pamet 16b

    //VALUE
    printf("2. %d\t\n", a[0]); // 1
    printf("1. %d\t\n", *a); // 1 -> а е указател към първия елемент от масива

    printf("3. %d\t\n", a[1]); // 2
    printf("4. %d\t\n", *(a+1)); // 2

    printf("5. %d\t\n", a[2]); // 2
    printf("6. %d\t\n", *(a+2)); // 2

    // out of range
    printf("5. %d\t\n", a[3]); // -618660224
    printf("6. %d\t\n", *(a+3)); // -618660224



    // ---------------------------------
    //ADRESS
    printf("7. 0x%x\t\n", a); // 0x365ffc20 
    //(16чен вид). Адреса на началото на масива, 
    // което съвпада със адреса на а[0]
    printf("8. 0x%x\t\n", &a[0]); // 0x365ffc20
}

// Aко елемента не е в масива:

