/*
Quicksort е много ефективен метод за сортиране. Ние последователно разделяме
списъка на по-малки списъци и прилагаме същият алгоритъм към подсписъка.
Алгоритъм:
Разглеждаме един елемент в даден момент (пивот) и го поставяме в правилната му
позиция.Всички елементи отляво на опората трябва да са по-малки от опората и
всички елементи вдясно да са по-големи.
Това разделя масива на две части - ляв дял и десен дял. Същият метод се прилага за
всеки дял. Процесът продължава, докато не може да се направи повече дял.
Всеки елемент може да бъде избран като опорна точка.
Рекурсивната функция е подобна на Mergesort, но не се разделя на две равни части, а се
разделя на база на основен елемент.
*/

void Quicksort( int a[], int lb,int ub)
{
int j;
if(lb<ub)
{
j=Partition(a,lb,ub); //partition the array
Quicksort(a,lb,j-1); //sort first partition
Quicksort(a,j+1,ub); //sort second partition
}
}
ub=горна граница
lb=долна граница
// https://www.studytonight.com/data-structures/quick-sort
// www.visualgo.net/en/sorting/