#include<stdio.h>

int main()
{
    int x = 5; // x е променлива
    int * ptr = &x; // ptr e променлива, която е указател към x
    int ** p = &ptr; // p e указател към указателя ptr

// Понеже ptr e указател към int => p ще е двоен указател към int int ** p;


    printf("1. %d", *ptr); //→ ще изведе стойността на целочислената променлива x
    printf("\n2. %d", **p); //→ прави същото
    printf("\n3. %d", *p); //→ извежда адреса на клетката, където е записан указателя ptr

    return 0;
}
/*
1. 5
2. 5
3. 167769860
*/